app/controllers/members_controller.rb

SELECT "members".* FROM "members"  ORDER BY number
---
  def index
    @members = Member.order("number")

SELECT "members".* FROM "members" WHERE (name LIKE '%佐藤%' OR full_name LIKE '%佐藤%')  ORDER BY number
---
  def search
    @members = Member.search(params[:q])

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @member = Member.find(params[:id])

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @member = Member.find(params[:id])